Revit 2027 API
YZJustificationOption Enumeration
 The option for whether a framing element has independent or uniform justification on its ends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum YZJustificationOption
Public Enumeration YZJustificationOption
public enum class YZJustificationOption
type YZJustificationOption
Members
Member name | Value | Description
Independent | 1 |  Independent justification settings applied to the element ends.
Uniform | 0 |  Uniform justification settings applied to the element ends.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace